Taxi/test_billing_fin_payouts/cron/static/test_cleanup_data/cleanup_accruals_by_ttl_expected.json

{
  "accruals": [
    {
      "accrual_id": 1,
      "amount": "102.00",
      "bill_num": null,
      "billing_contract_id": "676914",
      "client_id": "56579731",
      "created_at_utc": "2022-05-30 00:00:00",
      "dry_run": false,
      "idempotency_key": "INTERFACE_PAYMENTS/14341732235",
      "partner_currency": "RUB",
      "paysys_type_cc": "yandex",
      "reference_amount": "102.00",
      "reference_currency": "RUB",
      "service_id": 124,
      "terminalid": null,
      "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
      "transaction_type": "PAYMENT",
      "yandex_reward": "0.00"
    },
    {
      "accrual_id": 2,
      "amount": "10.00",
      "bill_num": null,
      "billing_contract_id": "808972",
      "client_id": "61092938",
      "created_at_utc": "2022-05-30 00:00:00",
      "dry_run": false,
      "idempotency_key": "INTERFACE_PAYMENTS/14341732236",
      "partner_currency": "BYN",
      "paysys_type_cc": "terminalid",
      "reference_amount": "10.00",
      "reference_currency": "BYN",
      "service_id": 125,
      "terminalid": "55411503",
      "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
      "transaction_type": "REFUND",
      "yandex_reward": "0.00"
    },
    {
      "accrual_id": 3,
      "amount": "128.00",
      "bill_num": null,
      "billing_contract_id": "3830002",
      "client_id": "94636168",
      "created_at_utc": "2022-05-30 00:00:00",
      "dry_run": false,
      "idempotency_key": "INTERFACE_PAYMENTS/14341732241",
      "partner_currency": "RUB",
      "paysys_type_cc": "psb_logist",
      "reference_amount": "128.00",
      "reference_currency": "RUB",
      "service_id": 124,
      "terminalid": null,
      "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
      "transaction_type": "PAYMENT",
      "yandex_reward": "0.00"
    },
    {
      "accrual_id": 4,
      "amount": "252.00",
      "bill_num": null,
      "billing_contract_id": "317971",
      "client_id": "37904064",
      "created_at_utc": "2022-05-30 00:00:00",
      "dry_run": false,
      "idempotency_key": "INTERFACE_PAYMENTS/14341732245",
      "partner_currency": "RUB",
      "paysys_type_cc": "terminalid",
      "reference_amount": "252.00",
      "reference_currency": "RUB",
      "service_id": 124,
      "terminalid": "57000589",
      "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
      "transaction_type": "PAYMENT",
      "yandex_reward": "0.00"
    },
    {
      "accrual_id": 5,
      "amount": "864.52",
      "bill_num": null,
      "billing_contract_id": "3050589",
      "client_id": "92907586",
      "created_at_utc": "2022-05-30 00:00:00",
      "dry_run": false,
      "idempotency_key": "INTERFACE_PAYMENTS/14341732247",
      "partner_currency": "RUB",
      "paysys_type_cc": "terminalid",
      "reference_amount": "864.52",
      "reference_currency": "RUB",
      "service_id": 124,
      "terminalid": "57000417",
      "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
      "transaction_type": "PAYMENT",
      "yandex_reward": "0.48"
    }
  ]
}
