Taxi/test_billing_fin_payouts/cron/static/test_cleanup_data/cleanup_batches_by_consumer_expected.json

{
  "batch_change_log": [
    {
      "batch_id": 3,
      "batch_status_code": "PAYOUT_READY",
      "idempotency_key": "3/PAYOUT_READY"
    },
    {
      "batch_id": 3,
      "batch_status_code": "EXPORT_READY",
      "idempotency_key": "3/EXPORT_READY"
    }
  ],
  "payout_batch": [
    {
      "amount_w_vat": "1234.58",
      "client_id": "123458",
      "contract_id": "854321",
      "contract_type": "revenues",
      "currency": "RUB",
      "firm_id": 13,
      "payout_batch_id": 3,
      "person_id": "333333",
      "status_code": "EXPORT_READY",
      "type_code": "PAYOUT"
    }
  ]
}
