Taxi/test_billing_fin_payouts/cron/static/test_cleanup_data/cleanup_interface_revenues_expected.json

{
  "expected_interface_table": [
    {
      "accounting_date": "2022-03-03T09:53:52.200001",
      "amount": "111111",
      "amount_tlog": "13",
      "client_id": "654321123",
      "contract_id": "123123",
      "created_at_utc": "2021-03-23 09:53:52.200001",
      "currency": "RUB",
      "id": 1,
      "payload": [
        {
          "attr": 123
        }
      ],
      "row_index": 123,
      "status_code": "NEW",
      "transaction_id": 12345
    },
    {
      "accounting_date": "2022-03-04T09:53:52.200001",
      "amount": "11111",
      "amount_tlog": "113",
      "client_id": "64321123",
      "contract_id": "12123",
      "created_at_utc": "2021-03-04 09:53:52.200001",
      "currency": "RUB",
      "id": 2,
      "payload": {},
      "row_index": 1223,
      "status_code": "NEW",
      "transaction_id": 123456
    }
  ],
  "table_name": "interface.revenues"
}
